import React from "react";
import { Link } from "react-router-dom";

import NewLine from "../components/NewLine";
import Italic from "../components/Italic";
import WhiteSpace from "../components/WhiteSpace";

function Stages() {
    return (
        <>
            <h2 className="heading">Етапи розвитку ІТ</h2>
            <p className="paragraph">
                <WhiteSpace/>Якщо в якості ознаки ІТ вибрати інструменти, за допомогою яких проводиться обробка інформації (інструментарій технології), то можна виділити наступні етапи її розвитку:
                <NewLine/>
                <Italic>1-й етап (до другої половини XIX ст.) - «Ручна»</Italic> інформаційна технологія, інструментарій якої складали: перо, чорнильниця, книга. Комунікації здійснювалися ручним способом 
                шляхом переправки через пошту листів, пакетів, депеш. Основна мета технології - представлення інформації в потрібній формі.
                <NewLine/>
                <Italic>2-й етап (з кінця XIX ст.) - «Механічна»</Italic> технологія, оснащена більш досконалими засобами доставки пошти, інструментарій якої складали:
                друкарська машинка, телефон, диктофон. Основна мета технології - представлення інформації в потрібній формі більш зручними засобами.
                <NewLine/>
                <Italic>3-й етап (40 - 60-і рр. XX ст.) - «Електрична»</Italic> технологія, інструментарій якої складали: великі ЕОМ і відповідне програмне забезпечення, 
                електричні друкарські машинки, ксерокси, портативні диктофони. Основна мета інформаційної технології починає переміщатися з форми представлення 
                інформації на формування її змісту.
                <NewLine/>
                <Italic>4-й етап (з початку 70-х рр.) - «Електронна»</Italic> технологія, основним інструментарієм якої стають великі ЕОМ і створені на їхній базі автоматизовані 
                системи управління (АСУ) і інформаційно-пошукові системи, оснащені широким спектром базових і спеціалізованих програмних комплексів. 
                Центр ваги технології ще більш зміщується на формування змістовної сторони інформації для управлінського середовища різних сфер суспільного 
                життя, особливо на організацію аналітичної роботи.
                <NewLine/>
                <Italic>5-й етап (з середини 80-х рр..) - «Комп'ютерна» («нова»)</Italic> технологія, основним інструментарієм якої є персональний комп'ютер із широким спектром 
                стандартних програмних продуктів різного призначення. На цьому етапі відбувається процес персоналізації АСУ, що проявляється у створенні систем 
                підтримки прийняття рішень певними спеціалістами. Подібні системи мають вмонтовані елементи аналізу та штучного інтелекту для різних рівнів
                управління, реалізуються на персональному комп'ютері і використовують телекомунікації. У зв'язку з переходом на мікропроцесорну базу істотним змінам піддаються і технічні засоби побутового, культурного та іншого призначення.
                <NewLine/>
                <Italic>6-й етап (тільки встановлюється) - «мережева технологія»</Italic> (іноді її вважають частиною комп'ютерних технологій). Починають широко використовуватися в
                різних галузях глобальні і локальні комп'ютерні мережі. Їй пророкують в найближчому майбутньому бурхливе зростання, обумовлене популярністю її 
                засновника - глобальної комп'ютерної мережі Internet.
            </p>
            <div className="more">
                <Link to="/benefits">Дивіться також: Переваги використання ІТ в освіті</Link>
            </div>
        </>
    );  
}

export default Stages;